xdu-aero-association/FM33LC0XX_Example_0.04/SVS 外部电压常使能中断/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_atim.h
/**
  *******************************************************************************************************
  * @file    fm33lc0xx_ll_atim.h
  * @author  FMSH Application Team
  * @brief   Head file of ATIM LL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LC0XX_LL_ATIM_H
#define __FM33LC0XX_LL_ATIM_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33xx.h"
/** @addtogroup FM33LC0XX_LL_Driver_ATIM
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup ATIM_LL_ES_INIT ATIM Exported Init structures
  * @{
  */

/**
  * @brief ATIM Init Sturcture definition
  */
typedef struct
{
    /*! 时钟源选择 */    
    uint32_t ClockSource;
    /*! 预分频系数 */       
    uint32_t Prescaler;        
    /*! 计数模式 */   
    uint32_t CounterMode;      
    /*! 自动重装载值 */   
    uint32_t Autoreload;
    /*! 预装载使能 */   
    uint32_t AutoreloadState;    
    /*! 定时器分频系数与数字滤波器所使用的采样时钟分频比 */   
    uint32_t ClockDivision;
    /*! 重复计数次数 */   
    uint32_t RepetitionCounter;    
                                                         
} LL_ATIM_InitTypeDef;
/**
  * @brief ATIM SlaveMode Init Sturcture definition
  */
typedef struct
{ 
         
    /*! 外部时钟源模式 */
    uint32_t SlaveMode;           
    /*! 输入触发信号选择 */
    uint32_t TriggerSrc; 
    /*! Trigger 延迟*/
    uint32_t TriggerDelay; 
                                                         
} LL_ATIM_SlaveInitTypeDef;

/**
  * @brief  TIM ETR  configuration structure definition.
  */

typedef struct
{
    /*! 外部触发使能 */    
    uint32_t AsExternal; 
   /*! 外部时钟滤波 */   
    uint32_t ETRFilter;       
    /*! 外部时钟分频 */
    uint32_t ETRClockDivision;
    /*! 外部时钟触发极性 */
    uint32_t ETRPolarity;      
                       
} LL_ATIM_ETR_InitTypeDef;

/**
  * @brief  TIM Output Compare configuration structure definition.
  */
typedef struct
{
    /*! 比较输出模式 */    
    uint32_t OCMode; 
    /*! 比较互补输出使能 */
    uint32_t OCNState;
    /*! 比较输出极性 */
    uint32_t OCPolarity; 
    /*! 比较互补输出极性 */
    uint32_t OCNPolarity;    
    /*! 比较输出通道快速模式使能 */
    uint32_t OCFastMode;       
    /*! 输出比较预装载 */
    uint32_t OCPreload;        
    /*! 通道比较值 */
    uint32_t CompareValue; 
    /*! 输出空闲状态电平 */
    uint32_t OCIdleState;    
    /*! ETR清0使能 */                                                 
    uint32_t OCETRFStatus;
    /*! 互补输出空闲状态电平 */
    uint32_t OCNIdleState;
  
} LL_ATIM_OC_InitTypeDef;
/**
  * @brief  TIM Input Capture configuration structure definition.
  */

typedef struct
{
    /*! 输入捕获使能 */    
    uint32_t CaptureState; 
    /*! 输入捕获极性 */    
    uint32_t ICPolarity;    
    /*! 通道映射激活的输入选择 */
    uint32_t ICActiveInput; 
    /*! 输入分频 */
    uint32_t ICPrescaler;   
    /*! 输入滤波 */
    uint32_t ICFilter;      
                       
} LL_ATIM_IC_InitTypeDef;

/**
  * @brief  BDTR (Break and Dead Time) structure definition
  */
typedef struct
{
    /*! 运行状态下的输出关闭状态 */    
    uint32_t OSSRState;      
    /*! 空闲状态下的输出关闭状态 */ 
    uint32_t OSSIState;      
    /*! 寄存器写保护等级 */
    uint32_t LockLevel;      
    /*! 死区时间 */
    uint32_t DeadTime;
    /*! 刹车使能 */
    uint32_t BreakState;
    /*! 刹车信号滤波 */
    uint32_t BreakFilter;
    /*! 刹车信号极性 */
    uint32_t BreakPolarity;
    /*! 刹车后计数器重装后自动输出使能*/
    uint32_t AutomaticOutput;
    /*! 刹车信号1门控 */
    uint32_t GatedBrakeSignal_1;
    /*! 刹车信号2门控 */
    uint32_t GatedBrakeSignal_2;
    /*! 两路刹车信号控制逻辑 */
    uint32_t BrakeSignalCombined;
                            
} LL_ATIM_BDTR_InitTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup ATIM_LL_Exported_Constants ATIM Exported Constants
  * @{
  */
#define    LL_ATIM_CHANNEL_1                                      (0x0U << 0U)
#define    LL_ATIM_CHANNEL_2                                      (0x1U << 0U)
#define    LL_ATIM_CHANNEL_3                                      (0x2U << 0U)
#define    LL_ATIM_CHANNEL_4                                      (0x3U << 0U)

#define    LL_ATIM_CLOCKDIVISION_DIV1                             (0x0U << ATIM_CR1_CKD_Pos)
#define    LL_ATIM_CLOCKDIVISION_DIV2                             (0x1U << ATIM_CR1_CKD_Pos)
#define    LL_ATIM_CLOCKDIVISION_DIV4                             (0x2U << ATIM_CR1_CKD_Pos)

#define    LL_ATIM_COUNTER_ALIGNED_EDGE                           (0x0U << ATIM_CR1_CMS_Pos)
#define    LL_ATIM_COUNTER_ALIGNED_CENTER_DOWN                    (0x1U << ATIM_CR1_CMS_Pos)
#define    LL_ATIM_COUNTER_ALIGNED_CENTER_UP                      (0x2U << ATIM_CR1_CMS_Pos)
#define    LL_ATIM_COUNTER_ALIGNED_CENTER_UP_DOWN                 (0x3U << ATIM_CR1_CMS_Pos)

#define    LL_ATIM_COUNTER_DIRECT_UP                              (0x0U << ATIM_CR1_DIR_Pos)
#define    LL_ATIM_COUNTER_DIRECT_DOWN                            (0x1U << ATIM_CR1_DIR_Pos)

#define    LL_ATIM_ONEPULSEMODE_REPETITIVE                        (0x0U << ATIM_CR1_OPM_Pos)
#define    LL_ATIM_ONEPULSEMODE_SINGLE                            (0x1U << ATIM_CR1_OPM_Pos)

#define    LL_ATIM_UPDATESOURCE_REGULAR                           (0x0U << ATIM_CR1_URS_Pos)
#define    LL_ATIM_UPDATESOURCE_COUNTER                           (0x1U << ATIM_CR1_URS_Pos)

#define    LL_ATIM_OCN_IDLESTATE_LOW                              (0x0U << ATIM_CR2_OISN_Pos)
#define    LL_ATIM_OCN_IDLESTATE_HIGH                             (0x1U << ATIM_CR2_OISN_Pos)

#define    LL_ATIM_OC_IDLESTATE_LOW                                (0x0U << ATIM_CR2_OIS_Pos)
#define    LL_ATIM_OC_IDLESTATE_HIGH                               (0x1U << ATIM_CR2_OIS_Pos)

#define    LL_ATIM_TRGO_RESET                                     (0x0U << ATIM_CR2_MMS_Pos)
#define    LL_ATIM_TRGO_ENABLE                                    (0x1U << ATIM_CR2_MMS_Pos)
#define    LL_ATIM_TRGO_UPDATE                                    (0x2U << ATIM_CR2_MMS_Pos)
#define    LL_ATIM_TRGO_CC1IF                                     (0x3U << ATIM_CR2_MMS_Pos)
#define    LL_ATIM_TRGO_OC1REF                                    (0x4U << ATIM_CR2_MMS_Pos)
#define    LL_ATIM_TRGO_OC2REF                                    (0x5U << ATIM_CR2_MMS_Pos)
#define    LL_ATIM_TRGO_OC3REF                                    (0x6U << ATIM_CR2_MMS_Pos)
#define    LL_ATIM_TRGO_OC4REF                                    (0x7U << ATIM_CR2_MMS_Pos)

#define    LL_ATIM_CCDMAREQUEST_CC                                (0x0U << ATIM_CR2_CCDS_Pos)
#define    LL_ATIM_CCDMAREQUEST_UPDATE                            (0x1U << ATIM_CR2_CCDS_Pos)

