xdu-aero-association/FM33LC0XX_Example_0.04/SVS 外部电压常使能中断/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_atim.h
#define    LL_ATIM_ETR_POLARITY_NONINVERTED                       (0x0U << ATIM_SMCR_ETP_Pos)
#define    LL_ATIM_ETR_POLARITY_NINVERTED                         (0x1U << ATIM_SMCR_ETP_Pos)

#define    LL_ATIM_ETR_PRESCALER_DIV1                             (0x0U << ATIM_SMCR_ETPS_Pos)
#define    LL_ATIM_ETR_PRESCALER_DIV2                             (0x1U << ATIM_SMCR_ETPS_Pos)
#define    LL_ATIM_ETR_PRESCALER_DIV4                             (0x2U << ATIM_SMCR_ETPS_Pos)
#define    LL_ATIM_ETR_PRESCALER_DIV8                             (0x3U << ATIM_SMCR_ETPS_Pos)

#define    LL_ATIM_ETR_FILTER_FDIV1                               (0x0U << ATIM_SMCR_ETF_Pos)
#define    LL_ATIM_ETR_FILTER_FDIV1_N2                            (0x1U << ATIM_SMCR_ETF_Pos)
#define    LL_ATIM_ETR_FILTER_FDIV1_N4                            (0x2U << ATIM_SMCR_ETF_Pos)
#define    LL_ATIM_ETR_FILTER_FDIV1_N8                            (0x3U << ATIM_SMCR_ETF_Pos)
#define    LL_ATIM_ETR_FILTER_FDIV2_N6                            (0x4U << ATIM_SMCR_ETF_Pos)
#define    LL_ATIM_ETR_FILTER_FDIV2_N8                            (0x5U << ATIM_SMCR_ETF_Pos)
#define    LL_ATIM_ETR_FILTER_FDIV4_N6                            (0x6U << ATIM_SMCR_ETF_Pos)
#define    LL_ATIM_ETR_FILTER_FDIV4_N8                            (0x7U << ATIM_SMCR_ETF_Pos)
#define    LL_ATIM_ETR_FILTER_FDIV8_N6                            (0x8U << ATIM_SMCR_ETF_Pos)
#define    LL_ATIM_ETR_FILTER_FDIV8_N8                            (0x9U << ATIM_SMCR_ETF_Pos)
#define    LL_ATIM_ETR_FILTER_FDIV16_N5                           (0xaU << ATIM_SMCR_ETF_Pos)
#define    LL_ATIM_ETR_FILTER_FDIV16_N6                           (0xbU << ATIM_SMCR_ETF_Pos)
#define    LL_ATIM_ETR_FILTER_FDIV16_N8                           (0xcU << ATIM_SMCR_ETF_Pos)
#define    LL_ATIM_ETR_FILTER_FDIV32_N5                           (0xdU << ATIM_SMCR_ETF_Pos)
#define    LL_ATIM_ETR_FILTER_FDIV32_N6                           (0xeU << ATIM_SMCR_ETF_Pos)
#define    LL_ATIM_ETR_FILTER_FDIV32_N8                           (0xfU << ATIM_SMCR_ETF_Pos)

#define    LL_ATIM_TIM_TS_ITR0                                    (0x0U << ATIM_SMCR_TS_Pos)
#define    LL_ATIM_TIM_TS_ITR1                                    (0x1U << ATIM_SMCR_TS_Pos)
#define    LL_ATIM_TIM_TS_ITR2                                    (0x2U << ATIM_SMCR_TS_Pos)
#define    LL_ATIM_TIM_TS_ITR3                                    (0x3U << ATIM_SMCR_TS_Pos)
#define    LL_ATIM_TIM_TS_TI1F_ED                                 (0x4U << ATIM_SMCR_TS_Pos)
#define    LL_ATIM_TIM_TS_TI1FP1                                  (0x5U << ATIM_SMCR_TS_Pos)
#define    LL_ATIM_TIM_TS_TI2FP1                                  (0x6U << ATIM_SMCR_TS_Pos)
#define    LL_ATIM_TIM_TS_ETRF                                    (0x7U << ATIM_SMCR_TS_Pos)

#define    LL_ATIM_SLAVE_MODE_PROHIBITED                          (0x0U << ATIM_SMCR_SMS_Pos)
#define    LL_ATIM_SLAVE_MODE_TI1FP1_TI2FP2_CNT                   (0x1U << ATIM_SMCR_SMS_Pos)
#define    LL_ATIM_SLAVE_MODE_TI2FP2_TI1FP1_CNT                   (0x2U << ATIM_SMCR_SMS_Pos)
#define    LL_ATIM_SLAVE_MODE_TI2FP2_CNT_TI1FP1_CNT               (0x3U << ATIM_SMCR_SMS_Pos)
#define    LL_ATIM_SLAVE_MODE_TRGI_RISE_RST                       (0x4U << ATIM_SMCR_SMS_Pos)
#define    LL_ATIM_SLAVE_MODE_TRGI_HIGH_RUN                       (0x5U << ATIM_SMCR_SMS_Pos)
#define    LL_ATIM_SLAVE_MODE_TRGI_RISE_RUN                       (0x6U << ATIM_SMCR_SMS_Pos)
#define    LL_ATIM_SLAVE_MODE_TRGI_CLK                            (0x7U << ATIM_SMCR_SMS_Pos)

#define    LL_ATIM_DMABURST_LENGTH_1TRANSFER                      (0x0U << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_2TRANSFERS                     (0x1U << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_3TRANSFERS                     (0x2U << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_4TRANSFERS                     (0x3U << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_5TRANSFERS                     (0x4U << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_6TRANSFERS                     (0x5U << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_7TRANSFERS                     (0x6U << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_8TRANSFERS                     (0x7U << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_9TRANSFERS                     (0x8U << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_10TRANSFERS                    (0x9U << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_11TRANSFERS                    (0xaU << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_12TRANSFERS                    (0xbU << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_13TRANSFERS                    (0xcU << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_14TRANSFERS                    (0xdU << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_15TRANSFERS                    (0xeU << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_16TRANSFERS                    (0xfU << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_17TRANSFERS                    (0x10U << ATIM_DCR_DBL_Pos)
#define    LL_ATIM_DMABURST_LENGTH_18TRANSFERS                    (0x11U << ATIM_DCR_DBL_Pos)

#define    LL_ATIM_DMABURST_BASEADDR_CR1                          (0x0U << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_CR2                          (0x1U << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_SMCR                         (0x2U << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_DIER                         (0x3U << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_SR                           (0x4U << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_EGR                          (0x5U << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_CCMR1                        (0x6U << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_CCMR2                        (0x7U << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_CCER                         (0x8U << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_CNT                          (0x9U << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_PSC                          (0xaU << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_ARR                          (0xbU << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_RCR                          (0xcU << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_CCR1                         (0xdU << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_CCR2                         (0xeU << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_CCR3                         (0xfU << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_CCR4                         (0x10U << ATIM_DCR_DBA_Pos)
#define    LL_ATIM_DMABURST_BASEADDR_BDTR                         (0x11U << ATIM_DCR_DBA_Pos)

#define    LL_ATIM_OC_MODE_FROZEN                                 (0x0U << ATIM_CCMR_OCM_Pos)
#define    LL_ATIM_OC_MODE_ACTIVE                                 (0x1U << ATIM_CCMR_OCM_Pos)
#define    LL_ATIM_OC_MODE_INACTIVE                               (0x2U << ATIM_CCMR_OCM_Pos)
#define    LL_ATIM_OC_MODE_TOGGLE                                 (0x3U << ATIM_CCMR_OCM_Pos)
#define    LL_ATIM_OC_MODE_FORCED_INACTIVE                        (0x4U << ATIM_CCMR_OCM_Pos)
#define    LL_ATIM_OC_MODE_FORCED_ACTIVE                          (0x5U << ATIM_CCMR_OCM_Pos)
#define    LL_ATIM_OC_MODE_PWM1                                   (0x6U << ATIM_CCMR_OCM_Pos)
#define    LL_ATIM_OC_MODE_PWM2                                   (0x7U << ATIM_CCMR_OCM_Pos)

