xdu-aero-association/FM33LC0XX_Example_0.04/SVS 外部电压常使能中断/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_atim.h
#define    LL_ATIM_IC_FILTER_FDIV1                                (0x0U << ATIM_CCMR_ICF_Pos)
#define    LL_ATIM_IC_FILTER_FDIV1_N2                             (0x1U << ATIM_CCMR_ICF_Pos)
#define    LL_ATIM_IC_FILTER_FDIV1_N4                             (0x2U << ATIM_CCMR_ICF_Pos)
#define    LL_ATIM_IC_FILTER_FDIV1_N8                             (0x3U << ATIM_CCMR_ICF_Pos)
#define    LL_ATIM_IC_FILTER_FDIV2_N6                             (0x4U << ATIM_CCMR_ICF_Pos)
#define    LL_ATIM_IC_FILTER_FDIV2_N8                             (0x5U << ATIM_CCMR_ICF_Pos)
#define    LL_ATIM_IC_FILTER_FDIV4_N6                             (0x6U << ATIM_CCMR_ICF_Pos)
#define    LL_ATIM_IC_FILTER_FDIV4_N8                             (0x7U << ATIM_CCMR_ICF_Pos)
#define    LL_ATIM_IC_FILTER_FDIV8_N6                             (0x8U << ATIM_CCMR_ICF_Pos)
#define    LL_ATIM_IC_FILTER_FDIV8_N8                             (0x9U << ATIM_CCMR_ICF_Pos)
#define    LL_ATIM_IC_FILTER_FDIV16_N5                            (0xaU << ATIM_CCMR_ICF_Pos)
#define    LL_ATIM_IC_FILTER_FDIV16_N6                            (0xbU << ATIM_CCMR_ICF_Pos)
#define    LL_ATIM_IC_FILTER_FDIV16_N8                            (0xcU << ATIM_CCMR_ICF_Pos)
#define    LL_ATIM_IC_FILTER_FDIV32_N5                            (0xdU << ATIM_CCMR_ICF_Pos)
#define    LL_ATIM_IC_FILTER_FDIV32_N6                            (0xeU << ATIM_CCMR_ICF_Pos)
#define    LL_ATIM_IC_FILTER_FDIV32_N8                            (0xfU << ATIM_CCMR_ICF_Pos)

#define    LL_ATIM_IC_PRESCALER_DIV_1                             (0x0U << ATIM_CCMR_ICPSC_Pos)
#define    LL_ATIM_IC_PRESCALER_DIV_2                             (0x1U << ATIM_CCMR_ICPSC_Pos)
#define    LL_ATIM_IC_PRESCALER_DIV_4                             (0x2U << ATIM_CCMR_ICPSC_Pos)
#define    LL_ATIM_IC_PRESCALER_DIV_8                             (0x3U << ATIM_CCMR_ICPSC_Pos)

#define    LL_ATIM_CC_MODE_OUTPUT                                 (0x0U << ATIM_CCMR_CCS_Pos)
#define    LL_ATIM_CC1_MODE_INPUT_TI1                             (0x1U << ATIM_CCMR_CCS_Pos)
#define    LL_ATIM_CC1_MODE_INPUT_TI2                             (0x2U << ATIM_CCMR_CCS_Pos)
#define    LL_ATIM_CC2_MODE_INPUT_TI2                             (0x1U << ATIM_CCMR_CCS_Pos)
#define    LL_ATIM_CC2_MODE_INPUT_TI1                             (0x2U << ATIM_CCMR_CCS_Pos)
#define    LL_ATIM_CC3_MODE_INPUT_TI3                             (0x1U << ATIM_CCMR_CCS_Pos)
#define    LL_ATIM_CC3_MODE_INPUT_TI4                             (0x2U << ATIM_CCMR_CCS_Pos)
#define    LL_ATIM_CC4_MODE_INPUT_TI4                             (0x1U << ATIM_CCMR_CCS_Pos)
#define    LL_ATIM_CC4_MODE_INPUT_TI3                             (0x2U << ATIM_CCMR_CCS_Pos)
#define    LL_ATIM_CC_MODE_INPUT_TRC                              (0x3U << ATIM_CCMR_CCS_Pos)

#define    LL_ATIM_OCN_POLARITY_HIGH                              (0x0U << ATIM_CCER_CCNP_Pos)
#define    LL_ATIM_OCN_POLARITY_LOW                               (0x1U << ATIM_CCER_CCNP_Pos)

#define    LL_ATIM_OC_POLARITY_HIGH                               (0x0U << ATIM_CCER_CCOP_Pos)
#define    LL_ATIM_OC_POLARITY_LOW                                (0x1U << ATIM_CCER_CCOP_Pos)

#define    LL_ATIM_IC_POLARITY_RISING                             (0x0U << ATIM_CCER_CCIP_Pos)
#define    LL_ATIM_IC_POLARITY_FALLING                            (0x1U << ATIM_CCER_CCIP_Pos)

#define    LL_ATIM_BREAK_POLARITY_LOW                             (0x0U << ATIM_BDTR_BKP_Pos)
#define    LL_ATIM_BREAK_POLARITY_HIGH                            (0x1U << ATIM_BDTR_BKP_Pos)

#define    LL_ATIM_OSSR_DISABLE                                   (0x0U << ATIM_BDTR_OSSR_Pos)
#define    LL_ATIM_OSSR_ENABLE                                    (0x1U << ATIM_BDTR_OSSR_Pos)

#define    LL_ATIM_OSSI_DISABLE                                   (0x0U << ATIM_BDTR_OSSI_Pos)
#define    LL_ATIM_OSSI_ENABLE                                    (0x1U << ATIM_BDTR_OSSI_Pos)

#define    LL_ATIM_LOCKLEVEL_OFF                                  (0x0U << ATIM_BDTR_LOCK_Pos)
#define    LL_ATIM_LOCKLEVEL_1                                    (0x1U << ATIM_BDTR_LOCK_Pos)
#define    LL_ATIM_LOCKLEVEL_2                                    (0x2U << ATIM_BDTR_LOCK_Pos)
#define    LL_ATIM_LOCKLEVEL_3                                    (0x3U << ATIM_BDTR_LOCK_Pos)

#define    LL_ATIM_BREAK1_GATE_LOW                                (0x0U << ATIM_BKCR_BRK1GATE_Pos)
#define    LL_ATIM_BREAK1_GATE_AUTO                               (0x1U << ATIM_BKCR_BRK1GATE_Pos)

#define    LL_ATIM_BREAK2_GATE_LOW                                (0x0U << ATIM_BKCR_BRK2GATE_Pos)
#define    LL_ATIM_BREAK2_GATE_AUTO                               (0x1U << ATIM_BKCR_BRK2GATE_Pos)

#define    LL_ATIM_BRK_FILTER_FDIV1                               (0x0U << ATIM_BKCR_BRKF_Pos)
#define    LL_ATIM_BRK_FILTER_FDIV1_N2                            (0x1U << ATIM_BKCR_BRKF_Pos)
#define    LL_ATIM_BRK_FILTER_FDIV1_N4                            (0x2U << ATIM_BKCR_BRKF_Pos)
#define    LL_ATIM_BRK_FILTER_FDIV1_N8                            (0x3U << ATIM_BKCR_BRKF_Pos)
#define    LL_ATIM_BRK_FILTER_FDIV2_N6                            (0x4U << ATIM_BKCR_BRKF_Pos)
#define    LL_ATIM_BRK_FILTER_FDIV2_N8                            (0x5U << ATIM_BKCR_BRKF_Pos)
#define    LL_ATIM_BRK_FILTER_FDIV4_N6                            (0x6U << ATIM_BKCR_BRKF_Pos)
#define    LL_ATIM_BRK_FILTER_FDIV4_N8                            (0x7U << ATIM_BKCR_BRKF_Pos)
#define    LL_ATIM_BRK_FILTER_FDIV8_N6                            (0x8U << ATIM_BKCR_BRKF_Pos)
#define    LL_ATIM_BRK_FILTER_FDIV8_N8                            (0x9U << ATIM_BKCR_BRKF_Pos)
#define    LL_ATIM_BRK_FILTER_FDIV16_N5                           (0xaU << ATIM_BKCR_BRKF_Pos)
#define    LL_ATIM_BRK_FILTER_FDIV16_N6                           (0xbU << ATIM_BKCR_BRKF_Pos)
#define    LL_ATIM_BRK_FILTER_FDIV16_N8                           (0xcU << ATIM_BKCR_BRKF_Pos)
#define    LL_ATIM_BRK_FILTER_FDIV32_N5                           (0xdU << ATIM_BKCR_BRKF_Pos)
#define    LL_ATIM_BRK_FILTER_FDIV32_N6                           (0xeU << ATIM_BKCR_BRKF_Pos)
#define    LL_ATIM_BRK_FILTER_FDIV32_N8                           (0xfU << ATIM_BKCR_BRKF_Pos)

