xdu-aero-association/FM33LC0XX_Example_0.04/SVS 外部电压常使能中断/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_atim.h
#define    LL_ATIM_BRK_COMBINATION_OR                             (0x0U << ATIM_BKCR_BRKCOMB_Pos)
#define    LL_ATIM_BRK_COMBINATION_XR                             (0x1U << ATIM_BKCR_BRKCOMB_Pos)
/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup ATIM_LL_Exported_Functions ATIM Exported Functions
  * @{
  */

/**
  * @brief    
  * @rmtoll   CR1    CKD    LL_ATIM_SetClockDivision
  * @param    TIMx TIM instance
  * @param    ClockDivision This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CLOCKDIVISION_DIV1
  *           @arg @ref LL_ATIM_CLOCKDIVISION_DIV2
  *           @arg @ref LL_ATIM_CLOCKDIVISION_DIV4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetClockDivision(ATIM_Type* TIMx, uint32_t ClockDivision)
{
    MODIFY_REG(TIMx->CR1, ATIM_CR1_CKD_Msk, ClockDivision);
}

/**
  * @brief    
  * @rmtoll   CR1    CKD    LL_ATIM_GetClockDivision
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_CLOCKDIVISION_DIV1
  *           @arg @ref LL_ATIM_CLOCKDIVISION_DIV2
  *           @arg @ref LL_ATIM_CLOCKDIVISION_DIV4
  */
__STATIC_INLINE uint32_t LL_ATIM_GetClockDivision(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_CKD_Msk));
}

/**
  * @brief    
  * @rmtoll   CR1    ARPE    LL_ATIM_EnableARRPreload
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableARRPreload(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->CR1, ATIM_CR1_ARPE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    ARPE    LL_ATIM_IsEnabledARRPreload
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledARRPreload(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_ARPE_Msk) == ATIM_CR1_ARPE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    ARPE    LL_ATIM_DisableARRPreload
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableARRPreload(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->CR1, ATIM_CR1_ARPE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    CMS    LL_ATIM_SetCounterAlignedMode
  * @param    TIMx TIM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_COUNTER_ALIGNED_EDGE
  *           @arg @ref LL_ATIM_COUNTER_ALIGNED_CENTER_DOWN
  *           @arg @ref LL_ATIM_COUNTER_ALIGNED_CENTER_UP
  *           @arg @ref LL_ATIM_COUNTER_ALIGNED_CENTER_UP_DOWN
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetCounterAlignedMode(ATIM_Type* TIMx, uint32_t mode)
{
    MODIFY_REG(TIMx->CR1, ATIM_CR1_CMS_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CR1    CMS    LL_ATIM_GetCounterAlignedMode
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_COUNTER_ALIGNED_EDGE
  *           @arg @ref LL_ATIM_COUNTER_ALIGNED_CENTER_DOWN
  *           @arg @ref LL_ATIM_COUNTER_ALIGNED_CENTER_UP
  *           @arg @ref LL_ATIM_COUNTER_ALIGNED_CENTER_UP_DOWN
  */
__STATIC_INLINE uint32_t LL_ATIM_GetCounterAlignedMode(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_CMS_Msk));
}

/**
  * @brief    
  * @rmtoll   CR1    DIR    LL_ATIM_SetCounterDirection
  * @param    TIMx TIM instance
  * @param    direct This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_COUNTER_DIRECT_UP
  *           @arg @ref LL_ATIM_COUNTER_DIRECT_DOWN
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetCounterDirection(ATIM_Type* TIMx, uint32_t direct)
{
    MODIFY_REG(TIMx->CR1, ATIM_CR1_DIR_Msk, direct);
}

/**
  * @brief    
  * @rmtoll   CR1    DIR    LL_ATIM_GetCounterDirection
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_COUNTER_DIRECT_UP
  *           @arg @ref LL_ATIM_COUNTER_DIRECT_DOWN
  */
__STATIC_INLINE uint32_t LL_ATIM_GetCounterDirection(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_DIR_Msk));
}

/**
  * @brief    
  * @rmtoll   CR1    OPM    LL_ATIM_SetOnePulseMode
  * @param    TIMx TIM instance
  * @param    OnePulseMode This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_ONEPULSEMODE_REPETITIVE
  *           @arg @ref LL_ATIM_ONEPULSEMODE_SINGLE
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetOnePulseMode(ATIM_Type* TIMx, uint32_t OnePulseMode)
{
    MODIFY_REG(TIMx->CR1, ATIM_CR1_OPM_Msk, OnePulseMode);
}

/**
  * @brief    
  * @rmtoll   CR1    OPM    LL_ATIM_GetOnePulseMode
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_ONEPULSEMODE_REPETITIVE
  *           @arg @ref LL_ATIM_ONEPULSEMODE_SINGLE
  */
__STATIC_INLINE uint32_t LL_ATIM_GetOnePulseMode(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_OPM_Msk));
}

/**
  * @brief    
  * @rmtoll   CR1    URS    LL_ATIM_SetUpdateSource
  * @param    TIMx TIM instance
  * @param    UpdateSource This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_UPDATESOURCE_REGULAR
  *           @arg @ref LL_ATIM_UPDATESOURCE_COUNTER
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetUpdateSource(ATIM_Type* TIMx, uint32_t UpdateSource)
{
    MODIFY_REG(TIMx->CR1, ATIM_CR1_URS_Msk, UpdateSource);
}

/**
  * @brief    
  * @rmtoll   CR1    URS    LL_ATIM_GetUpdateSource
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_UPDATESOURCE_REGULAR
  *           @arg @ref LL_ATIM_UPDATESOURCE_COUNTER
  */
__STATIC_INLINE uint32_t LL_ATIM_GetUpdateSource(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_URS_Msk));
}

/**
  * @brief    
  * @rmtoll   CR1    UDIS    LL_ATIM_EnableUpdateEvent
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableUpdateEvent(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->CR1, ATIM_CR1_UDIS_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    UDIS    LL_ATIM_IsEnabledUpdateEvent
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledUpdateEvent(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_UDIS_Msk) == ATIM_CR1_UDIS_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    UDIS    LL_ATIM_DisableUpdateEvent
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableUpdateEvent(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->CR1, ATIM_CR1_UDIS_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    CEN    LL_ATIM_EnableCounter
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableCounter(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->CR1, ATIM_CR1_CEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    CEN    LL_ATIM_IsEnabledCounter
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledCounter(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, ATIM_CR1_CEN_Msk) == ATIM_CR1_CEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    CEN    LL_ATIM_DisableCounter
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableCounter(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->CR1, ATIM_CR1_CEN_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   CR2    OISN    LL_ATIM_Set_OCN_SetIdleState
  * @param    TIMx TIM instance
  * @param    OCNIdleState This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_OCN_IDLESTATE_LOW
  *           @arg @ref LL_ATIM_OCN_IDLESTATE_HIGH
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Set_OCN_SetIdleState(ATIM_Type* TIMx, uint32_t OCNIdleState, uint32_t Channel)
{
    MODIFY_REG(TIMx->CR2, ATIM_CR2_OISN_Msk<<Channel, OCNIdleState); 
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   CR2    OISN    LL_ATIM_Get_OCN_SetIdleState
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_OCN_IDLESTATE_LOW
  *           @arg @ref LL_ATIM_OCN_IDLESTATE_HIGH
  */
__STATIC_INLINE uint32_t LL_ATIM_Get_OCN_SetIdleState(ATIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->CR2, (ATIM_CR2_OISN_Msk << Channel))); 
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   CR2    OIS    LL_ATIM_Set_OC_SetIdleState
  * @param    TIMx TIM instance
  * @param    OCIdleState This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_OC_IDLESTATE_LOW
  *           @arg @ref LL_ATIM_OC_IDLESTATE_HIGH
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Set_OC_SetIdleState(ATIM_Type* TIMx, uint32_t OCIdleState, uint32_t Channel)
{
    MODIFY_REG(TIMx->CR2, (ATIM_CR2_OIS_Msk<<Channel), OCIdleState); 
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   CR2    OIS    LL_ATIM_Get_OC_SetIdleState
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_OC_IDLESTATE_LOW
  *           @arg @ref LL_ATIM_OC_IDLESTATE_HIGH
  */
__STATIC_INLINE uint32_t LL_ATIM_Get_OC_SetIdleState(ATIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->CR2, (ATIM_CR2_OIS_Msk<<Channel))); 
}

/**
  * @brief    
  * @rmtoll   CR2    MMS    LL_ATIM_SetTriggerOutput
  * @param    TIMx TIM instance
  * @param    TimerSynchronization This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_TRGO_RESET
  *           @arg @ref LL_ATIM_TRGO_ENABLE
  *           @arg @ref LL_ATIM_TRGO_UPDATE
  *           @arg @ref LL_ATIM_TRGO_CC1IF
  *           @arg @ref LL_ATIM_TRGO_OC1REF
  *           @arg @ref LL_ATIM_TRGO_OC2REF
  *           @arg @ref LL_ATIM_TRGO_OC3REF
  *           @arg @ref LL_ATIM_TRGO_OC4REF
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetTriggerOutput(ATIM_Type* TIMx, uint32_t TimerSynchronization)
{
    MODIFY_REG(TIMx->CR2, ATIM_CR2_MMS_Msk, TimerSynchronization);
}

/**
  * @brief    
  * @rmtoll   CR2    MMS    LL_ATIM_GetTriggerOutput
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_TRGO_RESET
  *           @arg @ref LL_ATIM_TRGO_ENABLE
  *           @arg @ref LL_ATIM_TRGO_UPDATE
  *           @arg @ref LL_ATIM_TRGO_CC1IF
  *           @arg @ref LL_ATIM_TRGO_OC1REF
  *           @arg @ref LL_ATIM_TRGO_OC2REF
  *           @arg @ref LL_ATIM_TRGO_OC3REF
  *           @arg @ref LL_ATIM_TRGO_OC4REF
  */
__STATIC_INLINE uint32_t LL_ATIM_GetTriggerOutput(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR2, ATIM_CR2_MMS_Msk));
}

/**
  * @brief    
  * @rmtoll   CR2    CCDS    LL_ATIM_SetDMAReqTrigger
  * @param    TIMx TIM instance
  * @param    DMAReqTrigger This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CCDMAREQUEST_CC
  *           @arg @ref LL_ATIM_CCDMAREQUEST_UPDATE
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetDMAReqTrigger(ATIM_Type* TIMx, uint32_t DMAReqTrigger)
{
    MODIFY_REG(TIMx->CR2, ATIM_CR2_CCDS_Msk, DMAReqTrigger);
}

/**
  * @brief    
  * @rmtoll   CR2    CCDS    LL_ATIM_GetDMAReqTrigger
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_CCDMAREQUEST_CC
  *           @arg @ref LL_ATIM_CCDMAREQUEST_UPDATE
  */
__STATIC_INLINE uint32_t LL_ATIM_GetDMAReqTrigger(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR2, ATIM_CR2_CCDS_Msk));
}

/**
  * @brief    
  * @rmtoll   SMCR    ETP    LL_ATIM_SetETRPolarity
  * @param    TIMx TIM instance
  * @param    Polarity This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_ETR_POLARITY_NONINVERTED
  *           @arg @ref LL_ATIM_ETR_POLARITY_NINVERTED
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetETRPolarity(ATIM_Type* TIMx, uint32_t Polarity)
{
    MODIFY_REG(TIMx->SMCR, ATIM_SMCR_ETP_Msk, Polarity);
}

/**
  * @brief    
  * @rmtoll   SMCR    ETP    LL_ATIM_GetETRPolarity
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_ETR_POLARITY_NONINVERTED
  *           @arg @ref LL_ATIM_ETR_POLARITY_NINVERTED
  */
__STATIC_INLINE uint32_t LL_ATIM_GetETRPolarity(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->SMCR, ATIM_SMCR_ETP_Msk));
}

/**
  * @brief    
  * @rmtoll   SMCR    ECE    LL_ATIM_EnableExternalClock
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableExternalClock(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->SMCR, ATIM_SMCR_ECE_Msk);
}

/**
  * @brief    
  * @rmtoll   SMCR    ECE    LL_ATIM_IsEnabledExternalClock
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledExternalClock(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->SMCR, ATIM_SMCR_ECE_Msk) == ATIM_SMCR_ECE_Msk);
}

/**
  * @brief    
  * @rmtoll   SMCR    ECE    LL_ATIM_DisableExternalClock
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableExternalClock(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->SMCR, ATIM_SMCR_ECE_Msk);
}

/**
  * @brief    
  * @rmtoll   SMCR    ETPS    LL_ATIM_SetETRExtrenalTriggerPsc
  * @param    TIMx TIM instance
  * @param    Psc This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_ETR_PRESCALER_DIV1
  *           @arg @ref LL_ATIM_ETR_PRESCALER_DIV2
  *           @arg @ref LL_ATIM_ETR_PRESCALER_DIV4
  *           @arg @ref LL_ATIM_ETR_PRESCALER_DIV8
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetETRExtrenalTriggerPsc(ATIM_Type* TIMx, uint32_t Psc)
{
    MODIFY_REG(TIMx->SMCR, ATIM_SMCR_ETPS_Msk, Psc);
}

/**
  * @brief    
  * @rmtoll   SMCR    ETPS    LL_ATIM_GetETRExtrenalTriggerPsc
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_ETR_PRESCALER_DIV1
  *           @arg @ref LL_ATIM_ETR_PRESCALER_DIV2
  *           @arg @ref LL_ATIM_ETR_PRESCALER_DIV4
  *           @arg @ref LL_ATIM_ETR_PRESCALER_DIV8
  */
__STATIC_INLINE uint32_t LL_ATIM_GetETRExtrenalTriggerPsc(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->SMCR, ATIM_SMCR_ETPS_Msk));
}

/**
  * @brief    
  * @rmtoll   SMCR    ETF    LL_ATIM_SetETRExtrenalTriggerFilter
  * @param    TIMx TIM instance
  * @param    Filter This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV1
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV1_N2
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV1_N4
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV1_N8
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV2_N6
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV2_N8
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV4_N6
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV4_N8
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV8_N6
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV8_N8
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV16_N5
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV16_N6
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV16_N8
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV32_N5
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV32_N6
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV32_N8
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetETRExtrenalTriggerFilter(ATIM_Type* TIMx, uint32_t Filter)
{
    MODIFY_REG(TIMx->SMCR, ATIM_SMCR_ETF_Msk, Filter);
}

/**
  * @brief    
  * @rmtoll   SMCR    ETF    LL_ATIM_GetETRExtrenalTriggerFilter
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV1
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV1_N2
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV1_N4
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV1_N8
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV2_N6
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV2_N8
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV4_N6
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV4_N8
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV8_N6
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV8_N8
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV16_N5
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV16_N6
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV16_N8
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV32_N5
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV32_N6
  *           @arg @ref LL_ATIM_ETR_FILTER_FDIV32_N8
  */
__STATIC_INLINE uint32_t LL_ATIM_GetETRExtrenalTriggerFilter(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->SMCR, ATIM_SMCR_ETF_Msk));
}

/**
  * @brief    
  * @rmtoll   SMCR    MSM    LL_ATIM_EnableMasterSlaveMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableMasterSlaveMode(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->SMCR, ATIM_SMCR_MSM_Msk);
}

/**
  * @brief    
  * @rmtoll   SMCR    MSM    LL_ATIM_IsEnabledMasterSlaveMode
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledMasterSlaveMode(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->SMCR, ATIM_SMCR_MSM_Msk) == ATIM_SMCR_MSM_Msk);
}

/**
  * @brief    
  * @rmtoll   SMCR    MSM    LL_ATIM_DisableMasterSlaveMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableMasterSlaveMode(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->SMCR, ATIM_SMCR_MSM_Msk);
}

/**
  * @brief    
  * @rmtoll   SMCR    TS    LL_ATIM_SetTriggerInput
  * @param    TIMx TIM instance
  * @param    TriggerInput This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_TIM_TS_ITR0
  *           @arg @ref LL_ATIM_TIM_TS_ITR1
  *           @arg @ref LL_ATIM_TIM_TS_ITR2
  *           @arg @ref LL_ATIM_TIM_TS_ITR3
  *           @arg @ref LL_ATIM_TIM_TS_TI1F_ED
  *           @arg @ref LL_ATIM_TIM_TS_TI1FP1
  *           @arg @ref LL_ATIM_TIM_TS_TI2FP1
  *           @arg @ref LL_ATIM_TIM_TS_ETRF
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetTriggerInput(ATIM_Type* TIMx, uint32_t TriggerInput)
{
    MODIFY_REG(TIMx->SMCR, ATIM_SMCR_TS_Msk, TriggerInput);
}

/**
  * @brief    
  * @rmtoll   SMCR    TS    LL_ATIM_GetTriggerInput
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_TIM_TS_ITR0
  *           @arg @ref LL_ATIM_TIM_TS_ITR1
  *           @arg @ref LL_ATIM_TIM_TS_ITR2
  *           @arg @ref LL_ATIM_TIM_TS_ITR3
  *           @arg @ref LL_ATIM_TIM_TS_TI1F_ED
  *           @arg @ref LL_ATIM_TIM_TS_TI1FP1
  *           @arg @ref LL_ATIM_TIM_TS_TI2FP1
  *           @arg @ref LL_ATIM_TIM_TS_ETRF
  */
__STATIC_INLINE uint32_t LL_ATIM_GetTriggerInput(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->SMCR, ATIM_SMCR_TS_Msk));
}

/**
  * @brief    
  * @rmtoll   SMCR    SMS    LL_ATIM_SetSlaveMode
  * @param    TIMx TIM instance
  * @param    EncoderMode This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_SLAVE_MODE_PROHIBITED
  *           @arg @ref LL_ATIM_SLAVE_MODE_TI1FP1_TI2FP2_CNT
  *           @arg @ref LL_ATIM_SLAVE_MODE_TI2FP2_TI1FP1_CNT
  *           @arg @ref LL_ATIM_SLAVE_MODE_TI2FP2_CNT_TI1FP1_CNT
  *           @arg @ref LL_ATIM_SLAVE_MODE_TRGI_RISE_RST
  *           @arg @ref LL_ATIM_SLAVE_MODE_TRGI_HIGH_RUN
  *           @arg @ref LL_ATIM_SLAVE_MODE_TRGI_RISE_RUN
  *           @arg @ref LL_ATIM_SLAVE_MODE_TRGI_CLK
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetSlaveMode(ATIM_Type* TIMx, uint32_t EncoderMode)
{
    MODIFY_REG(TIMx->SMCR, ATIM_SMCR_SMS_Msk, EncoderMode);
}

/**
  * @brief    
  * @rmtoll   SMCR    SMS    LL_ATIM_GetSlaveMode
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_SLAVE_MODE_PROHIBITED
  *           @arg @ref LL_ATIM_SLAVE_MODE_TI1FP1_TI2FP2_CNT
  *           @arg @ref LL_ATIM_SLAVE_MODE_TI2FP2_TI1FP1_CNT
  *           @arg @ref LL_ATIM_SLAVE_MODE_TI2FP2_CNT_TI1FP1_CNT
  *           @arg @ref LL_ATIM_SLAVE_MODE_TRGI_RISE_RST
  *           @arg @ref LL_ATIM_SLAVE_MODE_TRGI_HIGH_RUN
  *           @arg @ref LL_ATIM_SLAVE_MODE_TRGI_RISE_RUN
  *           @arg @ref LL_ATIM_SLAVE_MODE_TRGI_CLK
  */
__STATIC_INLINE uint32_t LL_ATIM_GetSlaveMode(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->SMCR, ATIM_SMCR_SMS_Msk));
}

/**
  * @brief    
  * @rmtoll   DIER    CC1BURSTEN    LL_ATIM_EnableCC1BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableCC1BurstMode(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, ATIM_DIER_CC1BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC1BURSTEN    LL_ATIM_IsEnabledCC1BurstMode
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledCC1BurstMode(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, ATIM_DIER_CC1BURSTEN_Msk) == ATIM_DIER_CC1BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC1BURSTEN    LL_ATIM_DisableCC1BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableCC1BurstMode(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, ATIM_DIER_CC1BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC2BURSTEN    LL_ATIM_EnableCC2BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableCC2BurstMode(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, ATIM_DIER_CC2BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC2BURSTEN    LL_ATIM_IsEnabledCC2BurstMode
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledCC2BurstMode(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, ATIM_DIER_CC2BURSTEN_Msk) == ATIM_DIER_CC2BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC2BURSTEN    LL_ATIM_DisableCC2BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableCC2BurstMode(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, ATIM_DIER_CC2BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC3BURSTEN    LL_ATIM_EnableCC3BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableCC3BurstMode(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, ATIM_DIER_CC3BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC3BURSTEN    LL_ATIM_IsEnabledCC3BurstMode
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledCC3BurstMode(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, ATIM_DIER_CC3BURSTEN_Msk) == ATIM_DIER_CC3BURSTEN_Msk);
}

