xdu-aero-association/FM33LC0XX_Example_0.04/SVS 外部电压常使能中断/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_atim.h
/**
  * @brief    
  * @rmtoll   DIER    CC3BURSTEN    LL_ATIM_DisableCC3BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableCC3BurstMode(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, ATIM_DIER_CC3BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC4BURSTEN    LL_ATIM_EnableCC4BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableCC4BurstMode(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, ATIM_DIER_CC4BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC4BURSTEN    LL_ATIM_IsEnabledCC4BurstMode
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledCC4BurstMode(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, ATIM_DIER_CC4BURSTEN_Msk) == ATIM_DIER_CC4BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC4BURSTEN    LL_ATIM_DisableCC4BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableCC4BurstMode(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, ATIM_DIER_CC4BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    TDE    LL_ATIM_EnableDMAReq_TRIG
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableDMAReq_TRIG(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, ATIM_DIER_TDE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    TDE    LL_ATIM_IsEnabledDMAReq_TRIG
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledDMAReq_TRIG(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, ATIM_DIER_TDE_Msk) == ATIM_DIER_TDE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    TDE    LL_ATIM_DisableDMAReq_TRIG
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableDMAReq_TRIG(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, ATIM_DIER_TDE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   DIER    COMDE    LL_ATIM_EnableDMAReq_ComEvent
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableDMAReq_ComEvent(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, ATIM_DIER_COMDE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   DIER    COMDE    LL_ATIM_IsEnabledDMAReq_ComEvent
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledDMAReq_ComEvent(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, ATIM_DIER_COMDE_Msk) == ATIM_DIER_COMDE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   DIER    COMDE    LL_ATIM_DisableDMAReq_ComEvent
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableDMAReq_ComEvent(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, ATIM_DIER_COMDE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CCDE    LL_ATIM_EnableDMAReq
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableDMAReq(ATIM_Type* TIMx, uint32_t Channel)
{
    SET_BIT(TIMx->DIER, ATIM_DIER_CCDE_Msk << Channel ); 
}

/**
  * @brief    
  * @rmtoll   DIER    CCDE    LL_ATIM_IsEnabledDMAReq
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledDMAReq(ATIM_Type* TIMx, uint32_t Channel)
{
     return (uint32_t)(READ_BIT(TIMx->DIER, (ATIM_DIER_CCDE_Msk << Channel)) == (ATIM_DIER_CCDE_Msk << Channel));
}

/**
  * @brief    
  * @rmtoll   DIER    CCDE    LL_ATIM_DisableDMAReq
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableDMAReq(ATIM_Type* TIMx, uint32_t Channel)
{
     CLEAR_BIT(TIMx->DIER, ATIM_DIER_CCDE_Msk << Channel);  
}

/**
  * @brief    
  * @rmtoll   DIER    UDE    LL_ATIM_EnableDMAReq_UPDATE
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableDMAReq_UPDATE(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, ATIM_DIER_UDE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    UDE    LL_ATIM_IsEnabledDMAReq_UPDATE
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledDMAReq_UPDATE(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, ATIM_DIER_UDE_Msk) == ATIM_DIER_UDE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    UDE    LL_ATIM_DisableDMAReq_UPDATE
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableDMAReq_UPDATE(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, ATIM_DIER_UDE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   DIER    BIE    LL_ATIM_EnableIT_BRK
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableIT_BRK(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, ATIM_DIER_BIE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   DIER    BIE    LL_ATIM_IsEnabledIT_BRK
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledIT_BRK(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, ATIM_DIER_BIE_Msk) == ATIM_DIER_BIE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   DIER    BIE    LL_ATIM_DisableIT_BRK
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableIT_BRK(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, ATIM_DIER_BIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    TIE    LL_ATIM_EnableIT_TRIG
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableIT_TRIG(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, ATIM_DIER_TIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    TIE    LL_ATIM_IsEnabledIT_TRIG
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledIT_TRIG(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, ATIM_DIER_TIE_Msk) == ATIM_DIER_TIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    TIE    LL_ATIM_DisableIT_TRIG
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableIT_TRIG(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, ATIM_DIER_TIE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   DIER    COMIE    LL_ATIM_EnableIT_COM
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableIT_COM(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, ATIM_DIER_COMIE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   DIER    COMIE    LL_ATIM_IsEnabledIT_COM
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledIT_COM(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, ATIM_DIER_COMIE_Msk) == ATIM_DIER_COMIE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   DIER    COMIE    LL_ATIM_DisableIT_COM
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableIT_COM(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, ATIM_DIER_COMIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CCIE    LL_ATIM_EnableIT_CC
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableIT_CC(ATIM_Type* TIMx, uint32_t Channel)
{
    SET_BIT(TIMx->DIER, ATIM_DIER_CCIE_Msk << Channel ); 
}

/**
  * @brief    
  * @rmtoll   DIER    CCIE    LL_ATIM_IsEnabledIT_CC
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledIT_CC(ATIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->DIER,(ATIM_DIER_CCIE_Msk << Channel )) == (ATIM_DIER_CCIE_Msk << Channel));  
}

/**
  * @brief    
  * @rmtoll   DIER    CCIE    LL_ATIM_DisableIT_CC
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableIT_CC(ATIM_Type* TIMx, uint32_t Channel)
{
    CLEAR_BIT(TIMx->DIER, ATIM_DIER_CCIE_Msk << Channel ); 
}

/**
  * @brief    
  * @rmtoll   DIER    UIE    LL_ATIM_EnableIT_UPDATE
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableIT_UPDATE(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, ATIM_DIER_UIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    UIE    LL_ATIM_IsEnabledIT_UPDATE
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledIT_UPDATE(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, ATIM_DIER_UIE_Msk) == ATIM_DIER_UIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    UIE    LL_ATIM_DisableIT_UPDATE
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableIT_UPDATE(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, ATIM_DIER_UIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    CCOF    LL_ATIM_IsActiveFlag_CCOVR
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsActiveFlag_CCOVR(ATIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->ISR, (ATIM_ISR_CCOF_Msk << Channel)) == (ATIM_ISR_CCOF_Msk << Channel)); 
}

/**
  * @brief    
  * @rmtoll   ISR    CCOF    LL_ATIM_ClearFlag_CCOVR
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_ClearFlag_CCOVR(ATIM_Type* TIMx, uint32_t Channel)
{
    WRITE_REG(TIMx->ISR, (ATIM_ISR_CCOF_Msk << Channel));
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   ISR    BIF    LL_ATIM_IsActiveFlag_BRK
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsActiveFlag_BRK(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ISR, ATIM_ISR_BIF_Msk) == (ATIM_ISR_BIF_Msk));
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   ISR    BIF    LL_ATIM_ClearFlag_BRK
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_ClearFlag_BRK(ATIM_Type* TIMx)
{
    WRITE_REG(TIMx->ISR, ATIM_ISR_BIF_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    TIF    LL_ATIM_IsActiveFlag_TRIG
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsActiveFlag_TRIG(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ISR, ATIM_ISR_TIF_Msk) == (ATIM_ISR_TIF_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    TIF    LL_ATIM_ClearFlag_TRIG
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_ClearFlag_TRIG(ATIM_Type* TIMx)
{
    WRITE_REG(TIMx->ISR, ATIM_ISR_TIF_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   ISR    COMIF    LL_ATIM_IsActiveFlag_COM
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsActiveFlag_COM(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ISR, ATIM_ISR_COMIF_Msk) == (ATIM_ISR_COMIF_Msk));
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   ISR    COMIF    LL_ATIM_ClearFlag_COM
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_ClearFlag_COM(ATIM_Type* TIMx)
{
    WRITE_REG(TIMx->ISR, ATIM_ISR_COMIF_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    CCIF    LL_ATIM_IsActiveFlag_CC
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsActiveFlag_CC(ATIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->ISR, (ATIM_ISR_CCIF_Msk << Channel)) == (ATIM_ISR_CCIF_Msk << Channel));  
}

/**
  * @brief    
  * @rmtoll   ISR    CCIF    LL_ATIM_ClearFlag_CC
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_ClearFlag_CC(ATIM_Type* TIMx, uint32_t Channel)
{
    WRITE_REG(TIMx->ISR, (ATIM_ISR_CCIF_Msk << Channel)); 
}

/**
  * @brief    
  * @rmtoll   ISR    UIF    LL_ATIM_IsActiveFlag_UPDATE
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsActiveFlag_UPDATE(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ISR, ATIM_ISR_UIF_Msk) == (ATIM_ISR_UIF_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    UIF    LL_ATIM_ClearFlag_UPDATE
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_ClearFlag_UPDATE(ATIM_Type* TIMx)
{
    WRITE_REG(TIMx->ISR, ATIM_ISR_UIF_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   EGR    BG    LL_ATIM_GenerateEvent_BRK
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_GenerateEvent_BRK(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->EGR, ATIM_EGR_BG_Msk);
}

/**
  * @brief    
  * @rmtoll   EGR    TG    LL_ATIM_GenerateEvent_TRIG
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_GenerateEvent_TRIG(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->EGR, ATIM_EGR_TG_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   EGR    COMG    LL_ATIM_GenerateEvent_COM
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_GenerateEvent_COM(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->EGR, ATIM_EGR_COMG_Msk);
}

/**
  * @brief    
  * @rmtoll   EGR    CCG    LL_ATIM_GenerateEvent
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_GenerateEvent(ATIM_Type* TIMx, uint32_t Channel)
{
    SET_BIT(TIMx->EGR,ATIM_EGR_CCG_Msk << Channel ); 
}

/**
  * @brief    
  * @rmtoll   EGR    UG    LL_ATIM_GenerateEvent_UPDATE
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_GenerateEvent_UPDATE(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->EGR, ATIM_EGR_UG_Msk);
}

/**
  * @brief    
  * @rmtoll   CNT        LL_ATIM_SetCounter
  * @param    TIMx TIM instance
  * @param    counter 
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetCounter(ATIM_Type* TIMx, uint32_t counter)
{
    MODIFY_REG(TIMx->CNT, (0xffffU << 0U), (counter << 0U));
}

/**
  * @brief    
  * @rmtoll   CNT        LL_ATIM_GetCounter
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_ATIM_GetCounter(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CNT, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   PSC        LL_ATIM_SetPrescaler
  * @param    TIMx TIM instance
  * @param    Prescaler 
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetPrescaler(ATIM_Type* TIMx, uint32_t Prescaler)
{
    MODIFY_REG(TIMx->PSC, (0xffffU << 0U), (Prescaler << 0U));
}

/**
  * @brief    
  * @rmtoll   PSC        LL_ATIM_GetPrescaler
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_ATIM_GetPrescaler(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->PSC, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   ARR        LL_ATIM_SetAutoReload
  * @param    TIMx TIM instance
  * @param    AutoReload 
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetAutoReload(ATIM_Type* TIMx, uint32_t AutoReload)
{
    MODIFY_REG(TIMx->ARR, (0xffffU << 0U), (AutoReload << 0U));
}

/**
  * @brief    
  * @rmtoll   ARR        LL_ATIM_GetAutoReload
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_ATIM_GetAutoReload(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ARR, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   CCR1        LL_ATIM_SetCompareCH1
  * @param    TIMx TIM instance
  * @param    CompareValue 
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetCompareCH1(ATIM_Type* TIMx, uint32_t CompareValue)
{
    MODIFY_REG(TIMx->CCR1, (0xffffU << 0U), (CompareValue << 0U));
}

/**
  * @brief    
  * @rmtoll   CCR1        LL_ATIM_GetCompareCH1
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_ATIM_GetCompareCH1(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CCR1, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   CCR2        LL_ATIM_SetCompareCH2
  * @param    TIMx TIM instance
  * @param    CompareValue 
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetCompareCH2(ATIM_Type* TIMx, uint32_t CompareValue)
{
    MODIFY_REG(TIMx->CCR2, (0xffffU << 0U), (CompareValue << 0U));
}

/**
  * @brief    
  * @rmtoll   CCR2        LL_ATIM_GetCompareCH2
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_ATIM_GetCompareCH2(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CCR2, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   CCR3        LL_ATIM_SetCompareCH3
  * @param    TIMx TIM instance
  * @param    CompareValue 
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetCompareCH3(ATIM_Type* TIMx, uint32_t CompareValue)
{
    MODIFY_REG(TIMx->CCR3, (0xffffU << 0U), (CompareValue << 0U));
}

/**
  * @brief    
  * @rmtoll   CCR3        LL_ATIM_GetCompareCH3
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_ATIM_GetCompareCH3(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CCR3, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   CCR4        LL_ATIM_SetCompareCH4
  * @param    TIMx TIM instance
  * @param    CompareValue 
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetCompareCH4(ATIM_Type* TIMx, uint32_t CompareValue)
{
    MODIFY_REG(TIMx->CCR4, (0xffffU << 0U), (CompareValue << 0U));
}

/**
  * @brief    
  * @rmtoll   CCR4        LL_ATIM_GetCompareCH4
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_ATIM_GetCompareCH4(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CCR4, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   DCR    DBL    LL_ATIM_SetConfigDMABurstLenth
  * @param    TIMx TIM instance
  * @param    lenth This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_1TRANSFER
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_2TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_3TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_4TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_5TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_6TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_7TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_8TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_9TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_10TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_11TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_12TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_13TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_14TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_15TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_16TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_17TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_18TRANSFERS
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetConfigDMABurstLenth(ATIM_Type* TIMx, uint32_t lenth)
{
    MODIFY_REG(TIMx->DCR, ATIM_DCR_DBL_Msk, lenth);
}

/**
  * @brief    
  * @rmtoll   DCR    DBL    LL_ATIM_GetConfigDMABurstLenth
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_1TRANSFER
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_2TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_3TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_4TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_5TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_6TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_7TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_8TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_9TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_10TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_11TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_12TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_13TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_14TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_15TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_16TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_17TRANSFERS
  *           @arg @ref LL_ATIM_DMABURST_LENGTH_18TRANSFERS
  */
__STATIC_INLINE uint32_t LL_ATIM_GetConfigDMABurstLenth(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DCR, ATIM_DCR_DBL_Msk));
}

