xdu-aero-association/FM33LC0XX_Example_0.04/SVS 外部电压常使能中断/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_atim.h
/**
  * @brief    
  * @rmtoll   DCR    DBA    LL_ATIM_SetConfigDMABurstAddress
  * @param    TIMx TIM instance
  * @param    address This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CR1
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CR2
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_SMCR
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_DIER
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_SR
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_EGR
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CCMR1
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CCMR2
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CCER
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CNT
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_PSC
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_ARR
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_RCR
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CCR1
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CCR2
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CCR3
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CCR4
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_BDTR
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetConfigDMABurstAddress(ATIM_Type* TIMx, uint32_t address)
{
    MODIFY_REG(TIMx->DCR, ATIM_DCR_DBA_Msk, address);
}

/**
  * @brief    
  * @rmtoll   DCR    DBA    LL_ATIM_GetConfigDMABurstAddress
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CR1
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CR2
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_SMCR
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_DIER
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_SR
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_EGR
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CCMR1
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CCMR2
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CCER
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CNT
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_PSC
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_ARR
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_RCR
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CCR1
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CCR2
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CCR3
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_CCR4
  *           @arg @ref LL_ATIM_DMABURST_BASEADDR_BDTR
  */
__STATIC_INLINE uint32_t LL_ATIM_GetConfigDMABurstAddress(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DCR, ATIM_DCR_DBA_Msk));
}

/**
  * @brief    
  * @rmtoll   DMAR        LL_ATIM_SetConfigDMAR
  * @param    TIMx TIM instance
  * @param    Addr 
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetConfigDMAR(ATIM_Type* TIMx, uint32_t Addr)
{
    MODIFY_REG(TIMx->DMAR, (0xffffU << 0U), (Addr << 0U));
}

/**
  * @brief    
  * @rmtoll   DMAR        LL_ATIM_GetConfigDMAR
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_ATIM_GetConfigDMAR(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DMAR, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   CCMR    OCCE    LL_ATIM_Enable_Clear
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Enable_Clear(ATIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        SET_BIT(TIMx->CCMR1,(ATIM_CCMR_OCCE_Msk << (Channel*8)));
    }
    else
    {
        SET_BIT(TIMx->CCMR2,(ATIM_CCMR_OCCE_Msk << ((Channel-2)*8)));
    }      
}

/**
  * @brief    
  * @rmtoll   CCMR    OCCE    LL_ATIM_IsEnabled_Clear
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabled_Clear(ATIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR1,(ATIM_CCMR_OCCE_Msk << (Channel*8))) == (ATIM_CCMR_OCCE_Msk << (Channel*8)));
    }
    else
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR2,(ATIM_CCMR_OCCE_Msk << ((Channel-2)*8))) == (ATIM_CCMR_OCCE_Msk << ((Channel-2)*8)));
    }    
}

/**
  * @brief    
  * @rmtoll   CCMR    OCCE    LL_ATIM_Disable_Clear
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Disable_Clear(ATIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        CLEAR_BIT(TIMx->CCMR1,(ATIM_CCMR_OCCE_Msk << (Channel*8)));
    }
    else
    {
        CLEAR_BIT(TIMx->CCMR2,(ATIM_CCMR_OCCE_Msk << ((Channel-2)*8)));
    }  
}

/**
  * @brief    
  * @rmtoll   CCMR    OCM    LL_ATIM_SetOCMode
  * @param    TIMx TIM instance
  * @param    Mode This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_OC_MODE_FROZEN
  *           @arg @ref LL_ATIM_OC_MODE_ACTIVE
  *           @arg @ref LL_ATIM_OC_MODE_INACTIVE
  *           @arg @ref LL_ATIM_OC_MODE_TOGGLE
  *           @arg @ref LL_ATIM_OC_MODE_FORCED_INACTIVE
  *           @arg @ref LL_ATIM_OC_MODE_FORCED_ACTIVE
  *           @arg @ref LL_ATIM_OC_MODE_PWM1
  *           @arg @ref LL_ATIM_OC_MODE_PWM2
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetOCMode(ATIM_Type* TIMx, uint32_t Mode, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        MODIFY_REG(TIMx->CCMR1,(ATIM_CCMR_OCM_Msk << (Channel*8)),(Mode << (Channel*8)));
    }
    else
    {
        MODIFY_REG(TIMx->CCMR2,(ATIM_CCMR_OCM_Msk << ((Channel-2)*8)),(Mode << ((Channel-2)*8)));
    }  
}

/**
  * @brief    
  * @rmtoll   CCMR    OCM    LL_ATIM_GetOCMode
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_OC_MODE_FROZEN
  *           @arg @ref LL_ATIM_OC_MODE_ACTIVE
  *           @arg @ref LL_ATIM_OC_MODE_INACTIVE
  *           @arg @ref LL_ATIM_OC_MODE_TOGGLE
  *           @arg @ref LL_ATIM_OC_MODE_FORCED_INACTIVE
  *           @arg @ref LL_ATIM_OC_MODE_FORCED_ACTIVE
  *           @arg @ref LL_ATIM_OC_MODE_PWM1
  *           @arg @ref LL_ATIM_OC_MODE_PWM2
  */
__STATIC_INLINE uint32_t LL_ATIM_GetOCMode(ATIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR1, (ATIM_CCMR_OCM_Msk << (Channel*8))));
    }
    else
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR2, (ATIM_CCMR_OCM_Msk << ((Channel-2)*8))));
    } 
}

/**
  * @brief    
  * @rmtoll   CCMR    OCPE    LL_ATIM_Enable_Preload
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Enable_Preload(ATIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        SET_BIT(TIMx->CCMR1,(ATIM_CCMR_OCPE_Msk << (Channel*8)));
    }
    else
    {
        SET_BIT(TIMx->CCMR2,(ATIM_CCMR_OCPE_Msk << ((Channel-2)*8)));
    }   
}

/**
  * @brief    
  * @rmtoll   CCMR    OCPE    LL_ATIM_IsEnabled_Preload
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabled_Preload(ATIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR1,(ATIM_CCMR_OCPE_Msk << (Channel*8))) == (ATIM_CCMR_OCPE_Msk << (Channel*8)));
    }
    else
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR2,(ATIM_CCMR_OCPE_Msk << ((Channel-2)*8))) == (ATIM_CCMR_OCPE_Msk << ((Channel-2)*8)));
    }  
}

/**
  * @brief    
  * @rmtoll   CCMR    OCPE    LL_ATIM_Disable_Preload
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Disable_Preload(ATIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        CLEAR_BIT(TIMx->CCMR1,(ATIM_CCMR_OCPE_Msk << (Channel*8)));
    }
    else
    {
        CLEAR_BIT(TIMx->CCMR2,(ATIM_CCMR_OCPE_Msk << ((Channel-2)*8)));
    } 
}

/**
  * @brief    
  * @rmtoll   CCMR    OCFE    LL_ATIM_Enable_FastCompare
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Enable_FastCompare(ATIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        SET_BIT(TIMx->CCMR1,(ATIM_CCMR_OCFE_Msk << (Channel*8)));
    }
    else
    {
        SET_BIT(TIMx->CCMR2,(ATIM_CCMR_OCFE_Msk << ((Channel-2)*8)));
    }  
}

/**
  * @brief    
  * @rmtoll   CCMR    OCFE    LL_ATIM_IsEnabled_FastCompare
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabled_FastCompare(ATIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR1,(ATIM_CCMR_OCFE_Msk << (Channel*8))) == (ATIM_CCMR_OCFE_Msk << (Channel*8)));
    }
    else
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR2,(ATIM_CCMR_OCFE_Msk << ((Channel-2)*8))) == (ATIM_CCMR_OCFE_Msk << ((Channel-2)*8)));
    }  
}

/**
  * @brief    
  * @rmtoll   CCMR    OCFE    LL_ATIM_Disable_FastCompare
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Disable_FastCompare(ATIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        CLEAR_BIT(TIMx->CCMR1,(ATIM_CCMR_OCFE_Msk << (Channel*8)));
    }
    else
    {
        CLEAR_BIT(TIMx->CCMR2,(ATIM_CCMR_OCFE_Msk << ((Channel-2)*8)));
    }  
}

/**
  * @brief    
  * @rmtoll   CCMR    ICF    LL_ATIM_SetICModeFilter
  * @param    TIMx TIM instance
  * @param    filter This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV1
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV1_N2
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV1_N4
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV1_N8
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV2_N6
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV2_N8
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV4_N6
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV4_N8
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV8_N6
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV8_N8
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV16_N5
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV16_N6
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV16_N8
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV32_N5
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV32_N6
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV32_N8
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetICModeFilter(ATIM_Type* TIMx, uint32_t filter, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        MODIFY_REG(TIMx->CCMR1,(ATIM_CCMR_ICF_Msk << (Channel*8)),(filter << (Channel*8)));
    }
    else
    {
        MODIFY_REG(TIMx->CCMR2,(ATIM_CCMR_ICF_Msk << ((Channel-2)*8)),(filter << ((Channel-2)*8)));
    } 
}

/**
  * @brief    
  * @rmtoll   CCMR    ICF    LL_ATIM_GetICModeFilter
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV1
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV1_N2
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV1_N4
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV1_N8
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV2_N6
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV2_N8
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV4_N6
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV4_N8
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV8_N6
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV8_N8
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV16_N5
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV16_N6
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV16_N8
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV32_N5
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV32_N6
  *           @arg @ref LL_ATIM_IC_FILTER_FDIV32_N8
  */
__STATIC_INLINE uint32_t LL_ATIM_GetICModeFilter(ATIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR1, (ATIM_CCMR_ICF_Msk << (Channel*8))));
    }
    else
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR2, (ATIM_CCMR_ICF_Msk << ((Channel-2)*8))));
    } 
}

/**
  * @brief    
  * @rmtoll   CCMR    ICPSC    LL_ATIM_SetICModePrescaler
  * @param    TIMx TIM instance
  * @param    Psc This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_IC_PRESCALER_DIV_1
  *           @arg @ref LL_ATIM_IC_PRESCALER_DIV_2
  *           @arg @ref LL_ATIM_IC_PRESCALER_DIV_4
  *           @arg @ref LL_ATIM_IC_PRESCALER_DIV_8
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetICModePrescaler(ATIM_Type* TIMx, uint32_t Psc, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        MODIFY_REG(TIMx->CCMR1,(ATIM_CCMR_ICPSC_Msk << (Channel*8)),(Psc << (Channel*8)));
    }
    else
    {
        MODIFY_REG(TIMx->CCMR2,(ATIM_CCMR_ICPSC_Msk << ((Channel-2)*8)),(Psc << ((Channel-2)*8)));
    }  
}

/**
  * @brief    
  * @rmtoll   CCMR    ICPSC    LL_ATIM_GetICModePrescaler
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_IC_PRESCALER_DIV_1
  *           @arg @ref LL_ATIM_IC_PRESCALER_DIV_2
  *           @arg @ref LL_ATIM_IC_PRESCALER_DIV_4
  *           @arg @ref LL_ATIM_IC_PRESCALER_DIV_8
  */
__STATIC_INLINE uint32_t LL_ATIM_GetICModePrescaler(ATIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR1, (ATIM_CCMR_ICPSC_Msk << (Channel*8))));
    }
    else
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR2, (ATIM_CCMR_ICPSC_Msk << ((Channel-2)*8))));
    }   
}

/**
  * @brief    
  * @rmtoll   CCMR    CCS    LL_ATIM_SetChannelMode
  * @param    TIMx TIM instance
  * @param    Mode This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CC_MODE_OUTPUT
  *           @arg @ref LL_ATIM_CC1_MODE_INPUT_TI1
  *           @arg @ref LL_ATIM_CC1_MODE_INPUT_TI2
  *           @arg @ref LL_ATIM_CC2_MODE_INPUT_TI2
  *           @arg @ref LL_ATIM_CC2_MODE_INPUT_TI1
  *           @arg @ref LL_ATIM_CC3_MODE_INPUT_TI3
  *           @arg @ref LL_ATIM_CC3_MODE_INPUT_TI4
  *           @arg @ref LL_ATIM_CC4_MODE_INPUT_TI3
  *           @arg @ref LL_ATIM_CC4_MODE_INPUT_TI4
  *           @arg @ref LL_ATIM_CC_MODE_INPUT_TRC
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetChannelMode(ATIM_Type* TIMx, uint32_t Mode, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        MODIFY_REG(TIMx->CCMR1,(ATIM_CCMR_CCS_Msk << (Channel*8)),(Mode << (Channel*8)));
    }
    else
    {
        MODIFY_REG(TIMx->CCMR2,(ATIM_CCMR_CCS_Msk << ((Channel-2)*8)),(Mode << ((Channel-2)*8)));
    }  
}

/**
  * @brief    
  * @rmtoll   CCMR    CCS    LL_ATIM_GetChannelMode
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_CC_MODE_OUTPUT
  *           @arg @ref LL_ATIM_CC1_MODE_INPUT_TI1
  *           @arg @ref LL_ATIM_CC1_MODE_INPUT_TI2
  *           @arg @ref LL_ATIM_CC2_MODE_INPUT_TI2
  *           @arg @ref LL_ATIM_CC2_MODE_INPUT_TI1
  *           @arg @ref LL_ATIM_CC3_MODE_INPUT_TI3
  *           @arg @ref LL_ATIM_CC3_MODE_INPUT_TI4
  *           @arg @ref LL_ATIM_CC4_MODE_INPUT_TI3
  *           @arg @ref LL_ATIM_CC4_MODE_INPUT_TI4
  *           @arg @ref LL_ATIM_CC_MODE_INPUT_TRC
  */
__STATIC_INLINE uint32_t LL_ATIM_GetChannelMode(ATIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_ATIM_CHANNEL_3)
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR1, (ATIM_CCMR_CCS_Msk << (Channel*8))));
    }
    else
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR2, (ATIM_CCMR_CCS_Msk << ((Channel-2)*8))));
    }   
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   CCER    CCNP    LL_ATIM_SetOCPolartyReverseChannel
  * @param    TIMx TIM instance
  * @param    Polarty This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_OCN_POLARITY_HIGH
  *           @arg @ref LL_ATIM_OCN_POLARITY_LOW
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetOCPolartyReverseChannel(ATIM_Type* TIMx, uint32_t Polarty, uint32_t Channel)
{
    MODIFY_REG(TIMx->CCER,(ATIM_CCER_CCNP_Msk << (Channel*4)),(Polarty << (Channel*4)));
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   CCER    CCNP    LL_ATIM_GetOCPolartyReverseChannel
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_OCN_POLARITY_HIGH
  *           @arg @ref LL_ATIM_OCN_POLARITY_LOW
  */
__STATIC_INLINE uint32_t LL_ATIM_GetOCPolartReverseChannel(ATIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->CCER, (ATIM_CCER_CCNP_Msk << (Channel*4)))); 
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   CCER    CCNE    LL_ATIM_EnableReverseChannelOutPut
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableReverseChannelOutPut(ATIM_Type* TIMx, uint32_t Channel)
{
    SET_BIT(TIMx->CCER,(ATIM_CCER_CCNE_Msk << (Channel*4))); 
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   CCER    CCNE    LL_ATIM_IsEnabledReverseChannelOutPut
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledReverseChannelOutPut(ATIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->CCER,(ATIM_CCER_CCNE_Msk << (Channel*4))) == (ATIM_CCER_CCNE_Msk << (Channel*4)));  
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   CCER    CCNE    LL_ATIM_DisableReverseChannelOutPut
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableReverseChannelOutPut(ATIM_Type* TIMx, uint32_t Channel)
{
    CLEAR_BIT(TIMx->CCER,(ATIM_CCER_CCNE_Msk << (Channel*4))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCOP    LL_ATIM_SetOCPolartyNormalChannel
  * @param    TIMx TIM instance
  * @param    Polarty This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_OC_POLARITY_HIGH
  *           @arg @ref LL_ATIM_OC_POLARITY_LOW
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetOCPolartyNormalChannel(ATIM_Type* TIMx, uint32_t Polarty, uint32_t Channel)
{
    MODIFY_REG(TIMx->CCER,(ATIM_CCER_CCOP_Msk << (Channel*4)),(Polarty << (Channel*4))); 
}

