xdu-aero-association/FM33LC0XX_Example_0.04/SVS 外部电压常使能中断/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_atim.h
/**
  * @brief    
  * @rmtoll   CCER    CCOP    LL_ATIM_GetOCPolartyNormalChannel
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_OC_POLARITY_HIGH
  *           @arg @ref LL_ATIM_OC_POLARITY_LOW
  */
__STATIC_INLINE uint32_t LL_ATIM_GetOCPolartyNormalChannel(ATIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->CCER, (ATIM_CCER_CCOP_Msk << (Channel*4)))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCIP    LL_ATIM_SetICPolartyChannel
  * @param    TIMx TIM instance
  * @param    Polarty This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_IC_POLARITY_RISING
  *           @arg @ref LL_ATIM_IC_POLARITY_FALLING
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetICPolartyChannel(ATIM_Type* TIMx, uint32_t Polarty, uint32_t Channel)
{
    MODIFY_REG(TIMx->CCER,(ATIM_CCER_CCIP_Msk << (Channel*4)),(Polarty << (Channel*4))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCIP    LL_ATIM_GetICPolartyChannel
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_IC_POLARITY_RISING
  *           @arg @ref LL_ATIM_IC_POLARITY_FALLING
  */
__STATIC_INLINE uint32_t LL_ATIM_GetICPolartyChannel(ATIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->CCER, (ATIM_CCER_CCIP_Msk << (Channel*4)))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCOE    LL_ATIM_EnableNormalChannelOutput
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableNormalChannelOutput(ATIM_Type* TIMx, uint32_t Channel)
{
    SET_BIT(TIMx->CCER,(ATIM_CCER_CCE_Msk << (Channel*4))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCOE    LL_ATIM_IsEnabledNormalChannelOutput
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledNormalChannelOutput(ATIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->CCER,(ATIM_CCER_CCE_Msk << (Channel*4))) == (ATIM_CCER_CCE_Msk << (Channel*4))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCIE    LL_ATIM_DisableNormalChannelOutput
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableNormalChannelOutput(ATIM_Type* TIMx, uint32_t Channel)
{
    CLEAR_BIT(TIMx->CCER,(ATIM_CCER_CCE_Msk << (Channel*4))); 
}
/**
  * @brief    
  * @rmtoll   CCER    CCIE    LL_ATIM_EnableChannelCapture
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_EnableChannelCapture(ATIM_Type* TIMx, uint32_t Channel)
{
    SET_BIT(TIMx->CCER,(ATIM_CCER_CCE_Msk << (Channel*4))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCIE    LL_ATIM_IsEnabledChannelCapture
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabledChannelCapture(ATIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->CCER,(ATIM_CCER_CCE_Msk << (Channel*4))) == (ATIM_CCER_CCE_Msk << (Channel*4))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCIE    LL_ATIM_DisableChannelCapture
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_CHANNEL_1
  *           @arg @ref LL_ATIM_CHANNEL_2
  *           @arg @ref LL_ATIM_CHANNEL_3
  *           @arg @ref LL_ATIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_DisableChannelCapture(ATIM_Type* TIMx, uint32_t Channel)
{
    CLEAR_BIT(TIMx->CCER,(ATIM_CCER_CCE_Msk << (Channel*4)));  
}
/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   RCR        LL_ATIM_SetConfigRepeatCnt
  * @param    TIMx TIM instance
  * @param    RepeatCnt 
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetConfigRepeatCnt(ATIM_Type* TIMx, uint32_t RepeatCnt)
{
    MODIFY_REG(TIMx->RCR, (0xffU << 0U), (RepeatCnt << 0U));
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   RCR        LL_ATIM_GetConfigRepetCnt
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_ATIM_GetConfigRepetCnt(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->RCR, 0xffU) >> 0U);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    MOE    LL_ATIM_Enable_AllOutputs
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Enable_AllOutputs(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->BDTR, ATIM_BDTR_MOE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    MOE    LL_ATIM_IsEnabled_AllOutputs
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabled_AllOutputs(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BDTR, ATIM_BDTR_MOE_Msk) == ATIM_BDTR_MOE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    MOE    LL_ATIM_Disable_AllOutputs
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Disable_AllOutputs(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->BDTR, ATIM_BDTR_MOE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    AOE    LL_ATIM_Enable_AutomaticOutput
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Enable_AutomaticOutput(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->BDTR, ATIM_BDTR_AOE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    AOE    LL_ATIM_IsEnabled_AutomaticOutput
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabled_AutomaticOutput(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BDTR, ATIM_BDTR_AOE_Msk) == ATIM_BDTR_AOE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    AOE    LL_ATIM_Disable_AutomaticOutput
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Disable_AutomaticOutput(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->BDTR, ATIM_BDTR_AOE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    BKP    LL_ATIM_SetBreakPolarity
  * @param    TIMx TIM instance
  * @param    Polarity This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_BREAK_POLARITY_LOW
  *           @arg @ref LL_ATIM_BREAK_POLARITY_HIGH
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetBreakPolarity(ATIM_Type* TIMx, uint32_t Polarity)
{
    MODIFY_REG(TIMx->BDTR, ATIM_BDTR_BKP_Msk, Polarity);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    BKP    LL_ATIM_GetBreakPolarity
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_BREAK_POLARITY_LOW
  *           @arg @ref LL_ATIM_BREAK_POLARITY_HIGH
  */
__STATIC_INLINE uint32_t LL_ATIM_GetBreakPolarity(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BDTR, ATIM_BDTR_BKP_Msk));
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    BKE    LL_ATIM_Enable_BRK
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Enable_BRK(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->BDTR, ATIM_BDTR_BKE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    BKE    LL_ATIM_IsEnabled_BRK
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabled_BRK(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BDTR, ATIM_BDTR_BKE_Msk) == ATIM_BDTR_BKE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    BKE    LL_ATIM_Disable_BRK
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Disable_BRK(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->BDTR, ATIM_BDTR_BKE_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    OSSR    LL_ATIM_SetOffStates_Run
  * @param    TIMx TIM instance
  * @param    States This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_OSSR_DISABLE
  *           @arg @ref LL_ATIM_OSSR_ENABLE
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetOffStates_Run(ATIM_Type* TIMx, uint32_t States)
{
    MODIFY_REG(TIMx->BDTR, ATIM_BDTR_OSSR_Msk, States);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    OSSR    LL_ATIM_GetOffStates_Run
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_OSSR_DISABLE
  *           @arg @ref LL_ATIM_OSSR_ENABLE
  */
__STATIC_INLINE uint32_t LL_ATIM_GetOffStates_Run(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BDTR, ATIM_BDTR_OSSR_Msk));
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    OSSI    LL_ATIM_SetOffStates_Idel
  * @param    TIMx TIM instance
  * @param    States This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_OSSI_DISABLE
  *           @arg @ref LL_ATIM_OSSI_ENABLE
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetOffStates_Idel(ATIM_Type* TIMx, uint32_t States)
{
    MODIFY_REG(TIMx->BDTR, ATIM_BDTR_OSSI_Msk, States);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    OSSI    LL_ATIM_GetOffStates_Idel
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_OSSI_DISABLE
  *           @arg @ref LL_ATIM_OSSI_ENABLE
  */
__STATIC_INLINE uint32_t LL_ATIM_GetOffStates_Idel(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BDTR, ATIM_BDTR_OSSI_Msk));
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    LOCK    LL_ATIM_SetLockLevel
  * @param    TIMx TIM instance
  * @param    Locklevel This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_LOCKLEVEL_OFF
  *           @arg @ref LL_ATIM_LOCKLEVEL_1
  *           @arg @ref LL_ATIM_LOCKLEVEL_2
  *           @arg @ref LL_ATIM_LOCKLEVEL_3
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetLockLevel(ATIM_Type* TIMx, uint32_t Locklevel)
{
    MODIFY_REG(TIMx->BDTR, ATIM_BDTR_LOCK_Msk, Locklevel);
}
/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    LOCK    LL_ATIM_GetLockLevel
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_LOCKLEVEL_OFF
  *           @arg @ref LL_ATIM_LOCKLEVEL_1
  *           @arg @ref LL_ATIM_LOCKLEVEL_2
  *           @arg @ref LL_ATIM_LOCKLEVEL_3
  */
__STATIC_INLINE uint32_t LL_ATIM_GetLockLevel(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BDTR, ATIM_BDTR_LOCK_Msk));
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    DTG    LL_ATIM_SetDeadTimeGeneration
  * @param    TIMx TIM instance
  * @param    DeadTimeGenerat 
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetDeadTimeGeneration(ATIM_Type* TIMx, uint32_t DeadTimeGenerat)
{
    MODIFY_REG(TIMx->BDTR, (0xffU << 0U), (DeadTimeGenerat << 0U));
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BDTR    DTG    LL_ATIM_GetDeadTimeGeneration
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_ATIM_GetDeadTimeGeneration(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BDTR, 0xffU) >> 0U);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    BRK1GATE    LL_ATIM_SetBreak1GateState
  * @param    TIMx TIM instance
  * @param    State This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_BREAK1_GATE_LOW
  *           @arg @ref LL_ATIM_BREAK1_GATE_AUTO
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetBreak1GateState(ATIM_Type* TIMx, uint32_t State)
{
    MODIFY_REG(TIMx->BKCR, ATIM_BKCR_BRK1GATE_Msk, State);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    BRK1GATE    LL_ATIM_GetBreak1GateState
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_BREAK1_GATE_LOW
  *           @arg @ref LL_ATIM_BREAK1_GATE_AUTO
  */
__STATIC_INLINE uint32_t LL_ATIM_GetBreak1GateState(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BKCR, ATIM_BKCR_BRK1GATE_Msk));
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    BRK2GATE    LL_ATIM_SetBreak2GateState
  * @param    TIMx TIM instance
  * @param    State This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_BREAK2_GATE_LOW
  *           @arg @ref LL_ATIM_BREAK2_GATE_AUTO
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetBreak2GateState(ATIM_Type* TIMx, uint32_t State)
{
    MODIFY_REG(TIMx->BKCR, ATIM_BKCR_BRK2GATE_Msk, State);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    BRK2GATE    LL_ATIM_GetBreak2GateState
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_BREAK2_GATE_LOW
  *           @arg @ref LL_ATIM_BREAK2_GATE_AUTO
  */
__STATIC_INLINE uint32_t LL_ATIM_GetBreak2GateState(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BKCR, ATIM_BKCR_BRK2GATE_Msk));
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    BRKF    LL_ATIM_SetBreakFilter
  * @param    TIMx TIM instance
  * @param    Filter This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV1
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV1_N2
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV1_N4
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV1_N8
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV2_N6
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV2_N8
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV4_N6
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV4_N8
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV8_N6
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV8_N8
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV16_N5
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV16_N6
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV16_N8
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV32_N5
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV32_N6
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV32_N8
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetBreakFilter(ATIM_Type* TIMx, uint32_t Filter)
{
    MODIFY_REG(TIMx->BKCR, ATIM_BKCR_BRKF_Msk, Filter);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    BRKF    LL_ATIM_GetBreakFilter
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV1
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV1_N2
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV1_N4
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV1_N8
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV2_N6
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV2_N8
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV4_N6
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV4_N8
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV8_N6
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV8_N8
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV16_N5
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV16_N6
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV16_N8
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV32_N5
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV32_N6
  *           @arg @ref LL_ATIM_BRK_FILTER_FDIV32_N8
  */
__STATIC_INLINE uint32_t LL_ATIM_GetBreakFilter(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BKCR, ATIM_BKCR_BRKF_Msk));
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    BRKCOMB    LL_ATIM_SetBreakSignalCombination
  * @param    TIMx TIM instance
  * @param    Filter This parameter can be one of the following values:
  *           @arg @ref LL_ATIM_BRK_COMBINATION_OR
  *           @arg @ref LL_ATIM_BRK_COMBINATION_XR
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_SetBreakSignalCombination(ATIM_Type* TIMx, uint32_t Filter)
{
    MODIFY_REG(TIMx->BKCR, ATIM_BKCR_BRKCOMB_Msk, Filter);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    BRKCOMB    LL_ATIM_GetBreakSignalCombination
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ATIM_BRK_COMBINATION_OR
  *           @arg @ref LL_ATIM_BRK_COMBINATION_XR
  */
__STATIC_INLINE uint32_t LL_ATIM_GetBreakSignalCombination(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BKCR, ATIM_BKCR_BRKCOMB_Msk));
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    HFDET_BRKEN    LL_ATIM_Enable_HFDET_BRK
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Enable_HFDET_BRK(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->BKCR, ATIM_BKCR_HFDET_BRKEN_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    HFDET_BRKEN    LL_ATIM_IsEnabled_HFDET_BRK
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabled_HFDET_BRK(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BKCR, ATIM_BKCR_HFDET_BRKEN_Msk) == ATIM_BKCR_HFDET_BRKEN_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    HFDET_BRKEN    LL_ATIM_Disable_HFDET_BRK
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Disable_HFDET_BRK(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->BKCR, ATIM_BKCR_HFDET_BRKEN_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    SVD_BRKEN    LL_ATIM_Enable_SVD_BRK
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Enable_SVD_BRK(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->BKCR, ATIM_BKCR_SVD_BRKEN_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    SVD_BRKEN    LL_ATIM_IsEnabled_SVD_BRK
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabled_SVD_BRK(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BKCR, ATIM_BKCR_SVD_BRKEN_Msk) == ATIM_BKCR_SVD_BRKEN_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    SVD_BRKEN    LL_ATIM_Disable_SVD_BRK
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Disable_SVD_BRK(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->BKCR, ATIM_BKCR_SVD_BRKEN_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    COMP_BRKEN    LL_ATIM_Enable_COMP_BRK
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Enable_COMP_BRK(ATIM_Type* TIMx)
{
    SET_BIT(TIMx->BKCR, ATIM_BKCR_COMP_BRKEN_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    COMP_BRKEN    LL_ATIM_IsEnabled_COMP_BRK
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ATIM_IsEnabled_COMP_BRK(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->BKCR, ATIM_BKCR_COMP_BRKEN_Msk) == ATIM_BKCR_COMP_BRKEN_Msk);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BKCR    COMP_BRKEN    LL_ATIM_Disable_COMP_BRK
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_ATIM_Disable_COMP_BRK(ATIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->BKCR, ATIM_BKCR_COMP_BRKEN_Msk);
}

/**
  * @}
  */

/** @defgroup ATIM_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_ATIM_DeInit(ATIM_Type *TIMx);

void LL_ATIM_StructInit(LL_ATIM_InitTypeDef *TIM_InitStruct);
void LL_ATIM_SlaveModeStructInit(LL_ATIM_SlaveInitTypeDef *TIM_InitStruct);
void LL_ATIM_IC_StructInit(LL_ATIM_IC_InitTypeDef *TIM_ICInitStruct);
void LL_ATIM_OC_StructInit(LL_ATIM_OC_InitTypeDef *TIM_OC_InitStruct);
void LL_ATIM_ETRStructInit(LL_ATIM_ETR_InitTypeDef *TIM_InitStruct);
void LL_ATIM_BDTR_StructInit(LL_ATIM_BDTR_InitTypeDef *TIM_BDTR_InitStruct);
    
ErrorStatus LL_ATIM_Init(ATIM_Type *TIMx, LL_ATIM_InitTypeDef *TIM_InitStruct);
ErrorStatus LL_ATIM_IC_Init(ATIM_Type *TIMx, uint32_t Channel, LL_ATIM_IC_InitTypeDef* IC_InitStruct);
ErrorStatus LL_ATIM_ETR_Init(ATIM_Type *TIMx, LL_ATIM_ETR_InitTypeDef* TIM_InitStruct);
ErrorStatus LL_ATIM_SlaveMode_Init(ATIM_Type *TIMx, LL_ATIM_SlaveInitTypeDef *TIM_InitStruct);
ErrorStatus LL_ATIM_OC_Init(ATIM_Type *TIMx, uint32_t Channel, LL_ATIM_OC_InitTypeDef *TIM_OC_InitStruct);
ErrorStatus LL_ATIM_BDTR_Init(ATIM_Type *TIMx, LL_ATIM_BDTR_InitTypeDef *TIM_BDTR_InitStruct);
/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LC0XX_LL_ATIM_H*/

/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2019-10-24**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
